{
    "SidebarNavigation": {
        "home": {
            "title": "Главная"
        },
        "about": {
            "title": "Обо мне"
        },
        "portfolio": {
            "title": "Портфолио"
        },
        "contact": {
            "title": "Контакты"
        },
        "telegram": {
            "title": "Telegram"
        }
    },
    "ContactPage": {
        "title": "Свяжитесь со мной",
        "subtitle": "Вот где вы можете меня найти.",
        "logoNames": {
            "github": "GitHub",
            "linkedin": "LinkedIn",
            "email": "Почта",
            "workEmail": "Рабочая почта",
            "telegram": "Телеграм",
            "steam": "Steam",
            "discord": "Discord"
        }
    },
    "Metadata": {
        "defaultTitle": "Дмитрий Хохлов — Fullstack Разработчик",
        "template": "Дмитрий Хохлов",
        "defaultDescription": "Портфолио fullstack-разработчика. Специализируюсь на React, Next.js и TypeScript. Открыт к предложениям о работе."
    },
    "AboutPage": {
        "title": "Обо мне",
        "name": "Дмитрий Хохлов",
        "role": "FullStack Developer (TypeScript, Rust)",
        "downloadResume": "Скачать резюме",
        "showContacts": "Показать контакты",
        "hideContacts": "Скрыть контакты",
        "contacts": {
            "phone": "Телефон",
            "email": "Email",
            "telegram": "Telegram"
        },
        "summary": [
            "Опытный Backend-разработчик с фокусом на создании веб-приложений и микросервисных систем на базе Node.js, NestJS и TypeScript. Уверенно проектирую и реализую масштабируемые сервисы с использованием PostgreSQL, TypeORM, Docker, Redis и систем CI/CD.",
            "В работе применяю принципы Clean Architecture, SOLID, DDD, OOP и модульную архитектуру. Опыт включает проектирование и поддержку RESTful и GraphQL API, интеграцию сервисов, настройку автоматических процессов сборки и деплоя, а также оптимизацию производительности и надежности решений.",
            "Отлично ориентируюсь в экосистеме JavaScript/TypeScript, владею инструментами мониторинга (Grafana, Prometheus) и DevOps-практиками. Участвовал в создании и поддержке микросервисной архитектуры с нуля, включая настройку контейнеризации и взаимодействия между сервисами.",
            "Постоянно развиваюсь профессионально, внедряю лучшие практики, участвую в code review и проектировании архитектуры. Готов приносить пользу команде, создавая современные, надежные и поддерживаемые решения."
        ],
        "experienceTitle": "Опыт работы",
        "educationTitle": "Образование",
        "skillsTitle": "Навыки",
        "projectsTitle": "Проекты",
        "projectsDescription": "Все мои проекты вы можете оценить на",
        "education": {
            "university": "МИРЭА — Российский технологический университет",
            "degree": "Бакалавр, Информационные системы и технологии",
            "year": "2025",
            "projectTitle": "Учебная практика / Проекты",
            "projects": [
                "Info-Defender (ВКР): Разработка приложения для обучения кибербезопасности (TypeScript)",
                "Tambalik (Курсовая): Пошаговая стратегия с элементами выборов (TypeScript)",
                "BarbershopAPI: Реализация backend-сервисов и работа с PostgreSQL",
                "ShortLink: Настройка CI/CD пайплайнов для сервиса сокращения ссылок",
                "Ants (Курсовая): Симуляция жизни муравьев для изучения принципов ООП (C#)",
                "MobileProjects: Разработка мобильных приложений на Kotlin"
            ]
        },
        "jobs": [
            {
                "title": "Fullstack-разработчик",
                "company": "Cyberia Labs",
                "location": "Москва",
                "period": "Апрель 2024 — Декабрь 2025",
                "duration": "1 год 9 месяцев",
                "description": [
                    "Разрабатывал и внедрял алгоритмы преобразования Markdown в DOCX, улучшив качество формирования документов и автоматизацию отчетности.",
                    "Проектировал и создавал микросервисы с критически важным функционалом; настраивал развертывание через Docker Compose, оптимизировал сборку контейнеров, внедрил мониторинг с помощью Grafana и Prometheus.",
                    "Расширял функциональность существующих библиотек и сервисов на NestJS, TypeORM и PostgreSQL, обеспечивая масштабируемость и устойчивость решений.",
                    "Оптимизировал ядро поискового движка Meilisearch (на Rust), повысив производительность на 15% за счет улучшения алгоритмов индексации и поиска.",
                    "Модифицировал Node.js-библиотеки под бизнес-требования, обеспечив более тесную интеграцию с внутренней инфраструктурой.",
                    "Наставлял разработчиков: обучал NestJS, TypeORM, Rust и внутренним механизмам Meilisearch; участвовал в переходе проектов с Laravel (PHP) на NestJS, проводил code review, внедрял лучшие практики и единый архитектурный стиль.",
                    "Разрабатывал и поддерживал frontend-компоненты на MUI и shadcn, реализуя взаимодействие с backend API.",
                    "Сотрудничал с аналитиками при формировании и уточнении технических требований, помогая адаптировать задачи под реальную архитектуру и возможности продукта.",
                    "Разрабатывал сервисы с нуля и интегрировал их в общую сеть микросервисов, взаимодействующих по REST API.",
                    "Разрабатывал и поддерживал фронтенд как на чистом React, так и на Next.js, создавая модульные и переиспользуемые интерфейсы.",
                    "Использовал Material UI и shadcn/ui для построения UI-компонентов, настраивал темы, расширял базовые компоненты под проектные требования.",
                    "Реализовывал сложные клиентские интерфейсы: динамические формы, таблицы, фильтры, карусели, дашборды и страницы с интерактивными элементами.",
                    "Оптимизировал работу клиентского состояния, применяя Redux Toolkit, RTK Query и современные подходы к управлению данными в React.",
                    "Настраивал архитектуру приложений на Next.js, включая маршрутизацию, работу с серверными компонентами, SSR/SSG, а также интеграцию с backend API."
                ]
            },
            {
                "title": "Разработчик Node.js",
                "company": "Мобильные ТелеСистемы (МТС)",
                "location": "Россия",
                "period": "Октябрь 2022 — Апрель 2024",
                "duration": "1 год 7 месяцев",
                "description": [
                    "Участвовал в проектировании и реализации API и веб-интерфейсов; расширял и дорабатывал существующие модули, улучшая масштабируемость и стабильность системы.",
                    "Выявлял и устранял дефекты в промышленной среде, оптимизировал работу сервиса, обеспечивая выполнение SLA и стабильную доступность приложения.",
                    "Разрабатывал и поддерживал серверную логику на JavaScript/TypeScript и NestJS; работал с PostgreSQL и MongoDB, оптимизировал запросы и схемы хранения данных.",
                    "Настраивал взаимодействие микросервисов и веб-сервера, улучшал производительность и надёжность между компонентами системы.",
                    "Анализировал технические инциденты, проводил диагностику и разрабатывал устойчивые решения, которые предотвращали повторение проблем.",
                    "Работал с Git, npm/yarn и CI-процессами команды; участвовал в улучшении инфраструктуры и оптимизации процесса релизов.",
                    "Принимал участие во взаимодействии с аналитиками и инженерами эксплуатации, помогал уточнять технические требования и адаптировать их под архитектуру продукта.",
                    "Использовал Docker и Kubernetes, участвовал в развёртывании сервисов, тестировании окружений и интеграции с системами мониторинга."
                ]
            }
        ],
        "skills": "TypeScript, JavaScript, SQL, Git, SOLID, OOP, MVC, Node.js, Docker, CI/CD, REST API, PostgreSQL, Express.js, Jest, Redis, NestJS, WebSocket, Rust, Kubernetes, Docker Compose, Grafana, RabbitMQ, MUI, MongoDB, SaaS, NextJS, React, Redux"
    }
}